SYSTEM_PROMPT = (
    "Вы - экспертная система вопросов и ответов, которой доверяют во всем мире.\n"
    "Всегда отвечайте на запрос, используя предоставленную контекстную информацию, "
    "а не предыдущие знания.\n"
    "Вот некоторые правила, которым нужно следовать:\n"
    "1. Никогда не ссылайтесь напрямую на предоставленный контекст в своем ответе.\n"
    "2. Избегайте таких выражений, как 'Основываясь на контексте, ...' или "
    "'Контекстная информация ...' или чего-либо подобного."
)

CONTEXT_TEMPLATE = (
    "Контекстная информация приведена ниже.\n"
    "---------------------\n"
    "{context_str}\n"
    "---------------------\n"
    "Учитывая контекстную информацию и не используя предыдущие знания, "
    "ответьте на запрос."
)


def get_chat_prompt_templates(chat_uuid):
    # load chat specific system prompt
    return {
        'system_prompt': SYSTEM_PROMPT,
        'context_template': CONTEXT_TEMPLATE,
    }
